//班上有8位同學，他們進行了6次考試結果如下
//{ 1, 2, 3, 4, 5, 6, 7, 8 }, 
//{ 10, 35, 40, 100, 90, 85, 75, 70 }, 
//{ 37, 75, 77, 89, 64, 75, 70, 95 },
//{ 100, 70, 79, 90, 75, 70, 79, 90 }, 
//{ 77, 95, 70, 89, 60, 75, 85, 89 }, 
//{ 98, 70, 89, 90, 75, 90, 89, 90 },
//{ 90, 80, 100, 75, 50, 20, 99, 75 }
//請算出每位同學考最高分的次數
//(提示：二維陣列)


package hw4;

import java.util.Arrays;

public class HW4_6_ExamRank {
	
	public static void main(String[] args) {
		
		int[][] exam1 = { 
						{ 10, 35, 40, 100, 90, 85, 75, 70 }, 
						{ 37, 75, 77, 89, 64, 75, 70, 95 },
						{ 100, 70, 79, 90, 75, 70, 79, 90 }, 
						{ 77, 95, 70, 89, 60, 75, 85, 89 }, 
						{ 98, 70, 89, 90, 75, 90, 89, 90 },
						{ 90, 80, 100, 75, 50, 20, 99, 75 } };

		int[][] exam2 = { 
						{ 10, 35, 40, 100, 90, 85, 75, 70 }, 
						{ 37, 75, 77, 89, 64, 75, 70, 95 },
						{ 100, 70, 79, 90, 75, 70, 79, 90 }, 
						{ 77, 95, 70, 89, 60, 75, 85, 89 }, 
						{ 98, 70, 89, 90, 75, 90, 89, 90 },
						{ 90, 80, 100, 75, 50, 20, 99, 75 } };
		
		int[] student = new int[8];
				
		for (int i = 0 ; i < exam1.length ; i++) {
			Arrays.sort(exam1[i]);
			for (int j = 0 ; j < exam1[i].length ; j++) {						
				if (exam2[i][j] == exam1[i][exam2[i].length - 1]) {
					student[j]++;					
				}
			}
		}
		
		for (int m = 0 ; m < student.length ; m++) {
			System.out.println((m+1)+" 號同學考最高分的次數為 "+student[m]+" 次 ");		
		}
	}
}
